{
    "policies": [
        {
            "policy_name": "explicit user confirmation",
            "description": "Before taking any actions that update the booking database, such as booking, modifying flights, editing baggage, upgrading cabin class, or updating passenger information, list the action details and obtain explicit user confirmation (yes) to proceed.",
            "references": [
                "before taking any actions that update the booking database (booking, modifying flights, editing baggage, upgrading cabin class, or updating passenger information), you must list the action details and obtain explicit user confirmation (yes) to proceed."
            ]
        },
        {
            "policy_name": "obtain user id and trip details",
            "description": "The agent must first obtain the user id and then ask for the trip type, origin, and destination.",
            "references": [
                "the agent must first obtain the user id, then ask for the trip type, origin, destination."
            ]
        },
        {
            "policy_name": "check flight availability",
            "description": "Validate that the flight status is 'available'. Flights with the status 'delayed', 'on time', or 'flying' cannot be booked.",
            "references": [
                "if the status is \"available\", the flight has not taken off, available seats and prices are listed.",
                "if the status is \"delayed\" or \"on time\", the flight has not taken off, cannot be booked.",
                "if the status is \"flying\", the flight has taken off but not landed, cannot be booked."
            ]
        },
        {
            "policy_name": "validate passenger details",
            "description": "Ensure that each reservation can have at most five passengers. Collect the first name, last name, and date of birth for each passenger. All passengers must fly the same flights in the same cabin.",
            "references": [
                "passengers: each reservation can have at most five passengers. the agent needs to collect the first name, last name, and date of birth for each passenger. all passengers must fly the same flights in the same cabin."
            ]
        },
        {
            "policy_name": "validate payment method",
            "description": "Ensure that each reservation uses at most one travel certificate, one credit card, and up to three gift cards. All payment methods must already be in the user profile. The remaining amount of a travel certificate is not refundable.",
            "references": [
                "payment: each reservation can use at most one travel certificate, at most one credit card, and at most three gift cards. the remaining amount of a travel certificate is not refundable. all payment methods must already be in user profile for safety reasons.",
                "payment: each reservation can use at most one travel certificate, at most one credit card, and at most three gift cards. the remaining amount of a travel certificate is not refundable. all payment methods must already be in user profile for safety reasons.",
                "payment: each reservation can use at most one travel certificate, at most one credit card, and at most three gift cards. the remaining amount of a travel certificate is not refundable. all payment methods must already be in user profile for safety reasons."
            ]
        },
        {
            "policy_name": "offer travel insurance",
            "description": "Ask if the user wants to buy travel insurance, which costs $30 per passenger and enables a full refund if the flight needs to be canceled due to health or weather reasons.",
            "references": [
                "travel insurance: the agent should ask if the user wants to buy the travel insurance, which is 30 dollars per passenger and enables full refund if the user needs to cancel the flight given health or weather reasons."
            ]
        },
        {
            "policy_name": "validate checked bag allowance",
            "description": "Determine checked bag allowance based on membership tier and cabin class: Regular members get 0 free checked bags for basic economy, 1 each for economy, and 2 for business. Silver members get 1 free checked bag for basic economy, 2 for economy, and 3 for business. Gold members get 2 free checked bags for basic economy, 3 for economy, and 3 for business. Extra baggage costs $50 each.",
            "references": [
                "checked bag allowance: if the booking user is a regular member, 0 free checked bag for each basic economy passenger, 1 free checked bag for each economy passenger, and 2 free checked bags for each business passenger. if the booking user is a silver member, 1 free checked bag for each basic economy passenger, 2 free checked bag for each economy passenger, and 3 free checked bags for each business passenger. if the booking user is a gold member, 2 free checked bag for each basic economy passenger, 3 free checked bag for each economy passenger, and 3 free checked bags for each business passenger. each extra baggage is 50 dollars."
            ]
        }
    ]
}